package day3;

public class khjD3 {

	public static void main(String[] args) {
	/*이중 if문 
	 	* if문 안에 실행문 부분에 if문이 들어가 있는 형태
	 	* 조건식1도 참이고, 조건식2도 참이면 실행문을 실행해라.
	 	* if(조건식1){
	 	* 		if(조건식2){
	 	* 			실행문;
	 	* 		}
	 	* }
	 	* 
	 	* if(조건식1 && 조건식2){
	 	* 		실행문;
	 	* }
	  
	 * Switch문
	 	* 조건문 중 일부만 해결 가능
	 	* 특정 상황에서 switch문을 사용
	 		*식 또는 변수의 값 자체 범위가 제한적인 경우, %연산자를 이용하는 경우 
	 		*사용하는 변수의 값이 제한적인 경우 : 월 예제 => 1~12
	 	* break를 통해 switch문을 빠져나옴 => 실행문에서 break문을 못만나면 다음 실행문이 실행됨
	 	* 식 또는 변수의 값은 정수 값이여야 한다(문자 포함)
	 	* switch(식 또는 변수){
	 	* 	case 값1:      //if
	 	* 		실행문1;
	 	* 		break;
	 	* 	case 값2:      //else if
	 	* 		실행문2;
	 	* 		break;
	 	* 	  //....
	 	* 	default:      //else
	 	* 		실행문3;
	 	* }
	 	* 
	 
	 *조건문 사용시 주의 사항
	 	*괄호 갯수를 잘 맞추자.
	 	*괄호 순서를 잘 맞추자.
	 	*if문 조건식 옆에 ;를 붙이지 말자.
	 	*if(조건식){
	 	*		실행문;
	 	*}
	 	*
	 
	 *반복문(p.91)
	 	*규칙적인 작업을 반복적으로 할 때 사용하는 문법
	 	*for문, while문, do while문
	 	*규칙성과 반복횟수를 찾아야함.
	 		*반복횟수 : 초기화 + 조건식 + 증감식
	 		*규칙성  : 실행문
	 	*for문
	 		*for(1. 초기화 ; 2. 조건식 ; 4. 증감식 ){
	 		*	3.실행문;
	 		*}
	 		
	 	*초기화: 
	 		*조건식이나 실행문에서 사용하는 변수들을 초기화하는 위치
	 		*생략할 수 있음
	 	*조건식: 
	 		*반복문이 동작할지 말지를 결정하는 곳, 참이면 실행문으로 가고 거짓이면 반복문을 종료.
	 		*생략할 수 있음(단, 생략하면 무조건 참)
	 	*증감식: 
	 		*반복횟수를 결정하는 변수를 증가하거나 감소하는 곳. 
	 		*생략할 수 있음
	 	*홍길동 학생 1부터 10까지 세어보세요.
	 		*초기화 : 홍길동 학생이 말해야할 숫자를 1로 알려줌
	 		*조건식 : 홀길동 학생이 말해야할 숫자가 10보다 작거나 같은지를 확인
	 		*증감식 : 홀길동 학생이 말해야할 숫자를 1증가시킴
	 		*실행문 : 홀길동 학생이 말해야할 숫자를 말함

	 * */
		
		
	}

}
